# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
# tap "ngrok/ngrok"
# tap "zen-browser/browser", "https://github.com/zen-browser/desktop.git"


# Code
brew "python"
brew "jupyterlab"
brew "poetry"
brew "git"
brew "go"
brew "golang"
brew "golangci-lint"
brew "elixir"
brew "neovim"
cask "visual-studio-code"
# cask "visual-studio-code-insiders"
cask "sublime-text"
cask "zed"
cask "jetbrains-toolbox"
cask "pycharm"
cask "docker"
brew "podman"
cask "podman-desktop"
brew "cmake"
brew "node"
brew "ipython"
cask "dbeaver-community"
cask "pgadmin4"
cask "mongodb-compass"
cask "postman"
cask "fork"
cask "github"
cask "sublime-merge"
brew "postgresql"
brew "uv"
brew "helix"
brew "poetry"
brew "ruff"
brew "flake8"
brew "black"
brew "pre-commit"
cask "cursor"
cask "gitup"
brew "numpy"


# CLI
brew "mas"
brew "bat"
brew "thefuck"
brew "tldr"
brew "fzf"
brew "z"
brew "tree"
brew "wget"
brew "gping"
brew "htop"
brew "ffmpeg"
brew "asciinema"
brew "telnet"
brew "kubectl"
brew "minikube"
brew "protobuf"
brew "gh"
brew "kubernetes-cli"
brew "neofetch"
brew "ripgrep"
brew "lazygit"
brew "lazydocker"
brew "fd"
brew "clifm"
brew "btop"
brew "curl"
brew "starship"
brew "pygments"
brew "eza"
brew "zoxide"
brew "docker-completion"
brew "rsync"
brew "pure"


# Terminal
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
brew "tmux"
brew "zellij"
brew "fish"
brew "fisher"
cask "iterm2"
cask "kitty"
cask "warp"


# Tools
cask "mos"
# cask "bitwarden"
cask "rectangle-pro"
cask "coconutbattery"
cask "raycast"
cask "appcleaner"
cask "displaperture"
cask "syncalicious"
# cask "hiddenbar"
cask "jordanbaird-ice"
cask "keka"
cask "balenaetcher"
cask "qmk-toolbox"
cask "deepl"
cask "imageoptim"
cask "shottr"
# cask "syncthing"
cask "blackhole-2ch"
cask "protonvpn"
# cask "cakebrew"
# cask "little-snitch"
# cask "ngrok"
# cask "zerotier-one"
cask "synology-drive"
cask "synologyassistant"
cask "resilio-sync"
cask "1password"
cask "bettertouchtool"
cask "karabiner-elements"
cask "topnotch"
cask "aldente"
cask "grandperspective"


# Apps
cask "telegram"
cask "whatsapp"
cask "zoom"
cask "obsidian"
cask "calibre"
cask "spotify"
cask "discord"
cask "skype"
cask "slack"
cask "microsoft-teams"
cask "marta"
cask "adobe-acrobat-reader"
cask "miro"
cask "notion"
cask "figma"
cask "steam"
cask "todoist"
cask "transmission"
cask "vlc"
cask "iina"
cask "anydesk"
cask "teamviewer"
cask "microsoft-remote-desktop"
cask "nrlquaker-winbox"
cask "epic-games"
cask "nvidia-geforce-now"
# cask "cron"
# cask "cloudcompare"
# cask "meshlab"
# cask "blender"
# cask "tigervnc-viewer"
cask "arc"
cask "firefox"
cask "google-chrome"
cask "chatgpt"
# cask "notion-calendar"
cask "logitech-options"
# cask "zen-browser"


# Fonts
cask "font-monaspace"
cask "font-fira-code"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-jetbrains-mono"
cask "font-martian-mono"
cask "font-meslo-lg"
cask "font-poppins"
cask "font-red-hat-mono"
cask "font-source-code-pro"
cask "font-ubuntu-mono"

cask "font-symbols-only-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace-nerd-font"
cask "font-martian-mono-nerd-font"
cask "font-ubuntu-mono-nerd-font"


# App Store
mas "Amphetamine", id: 937984704
# mas "The Unarchiver", id: 425424353
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "iMovie", id: 408981434
# mas "GarageBand", id: 682658836
mas "Desk Remote Control", id: 1509037746
mas "WireGuard", id: 1451685025
# mas "Norka VPN", id: 6444030286
mas "PDFgear", id: 6469021132

# Safari Extensions
mas "AdGuard for Safari", id: 1440147259
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Save to Pocket", id: 1477385213
mas "Bitwarden", id: 1352778147
mas "Consent-O-Matic", id: 1606897889
mas "Hush", id: 1544743900
mas "Noir", id: 1592917505
mas "PayPal Honey", id: 1472777122
mas "Polyglot", id: 1471801525
mas "SponsorBlock", id: 1573461917
mas "Wipr", id: 1320666476
mas "1Password for Safari", id: 1569813296
mas "Save to Raindrop.io", id: 1549370672
mas "Vimari", id: 1480933944


# VsCode
vscode "akamud.vscode-theme-onedark"
vscode "akarlsten.vscode-snazzy-akarlsten"
vscode "alefragnani.project-manager"
vscode "andenetalexander.vim-cheatsheet"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "batisteo.vscode-django"
vscode "casualjim.gotemplate"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "jakebecker.elixir-ls"
vscode "johnpapa.vscode-peacock"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "modular-mojotools.vscode-mojo"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mvllow.rose-pine"
vscode "ninoseki.vscode-pylens"
vscode "oderwat.indent-rainbow"
vscode "peterj.proto"
vscode "pmndrs.pmndrs"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "tatsy.vscode-3d-preview"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "zhuangtongfa.material-theme"