# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "ngrok/ngrok"


# Code
brew "python@3.11"
brew "jupyterlab"
brew "poetry"
brew "git"
brew "golang"
brew "golangci-lint"
brew "neovim"
cask "visual-studio-code"
cask "visual-studio-code-insiders"
cask "sublime-text"
cask "zed"
cask "jetbrains-toolbox"
brew "docker"
brew "cmake"
brew "node"
brew "ipython"
brew "postgresql@14"
brew "redis"
cask "dbeaver-community"
cask "postman"
cask "fork"
cask "github"

cask "sourcetree"
cask "sublime-merge"


# CLI
brew "mas"
brew "exa"
brew "bat"
brew "thefuck"
brew "tldr"
brew "fzf"
brew "z"
brew "tree"
brew "wget"
brew "gping"
brew "htop"
brew "ffmpeg"
brew "asciinema"
cask "zerotier-one"
brew "telnet"
brew "curl"
brew "neofetch"


# Terminal
brew "fish"
brew "fisher"
cask "kitty"
brew "tmux"
cask "iterm2"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"
cask "warp"


# Tools
cask "mos"
cask "bitwarden"
cask "rectangle-pro"
cask "coconutbattery"
cask "raycast"
cask "appcleaner"
cask "displaperture"
cask "syncalicious"
cask "hiddenbar"
cask "keka"
cask "balenaetcher"
cask "qmk-toolbox"
cask "deepl"
cask "imageoptim"
cask "shottr"
cask "syncthing"

cask "cakebrew"
cask "ngrok"
# cask "synology-drive"


# Apps
cask "telegram"
cask "whatsapp"
cask "zoom"
cask "obsidian"
cask "calibre"
cask "spotify"
cask "discord"
cask "skype"
cask "slack"
cask "microsoft-teams"
cask "marta"
cask "adobe-acrobat-reader"
cask "miro"
cask "notion"
cask "figma"
cask "steam"
cask "todoist"
cask "transmission"
cask "vlc"
cask "iina"
cask "anydesk"
cask "teamviewer"
cask "microsoft-remote-desktop"
cask "nrlquaker-winbox"
cask "epic-games"
cask "nvidia-geforce-now"

cask "cloudcompare"
cask "meshlab"
cask "blender"
# cask "tigervnc-viewer"


# Fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-martian-mono"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-poppins"
cask "font-red-hat-mono"
cask "font-source-code-pro"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"


# App Store
mas "Amphetamine", id: 937984704
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
mas "Pages", id: 409201541
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "iMovie", id: 408981434
mas "GarageBand", id: 682658836
mas "AdGuard for Safari", id: 1440147259
mas "Desk Remote Control", id: 1509037746
mas "DuckDuckGo Privacy for Safari", id: 1482920575
mas "Save to Pocket", id: 1477385213
mas "WireGuard", id: 1451685025
