### Taps ###

tap "homebrew/bundle"
tap "homebrew/services"
# tap "ngrok/ngrok"


### Code ###

brew "aider"
# brew "black"
brew "cmake"
brew "claude-code"
brew "codex"
brew "elixir"
# cask "cursor"
# brew "flake8"
brew "gemini-cli"
brew "git"
brew "go"
brew "golangci-lint"
# brew "helix"
brew "ipython"
brew "jupyterlab"
brew "neovim"
brew "node"
# brew "numpy"
brew "oven-sh/bun/bun"
# brew "podman"
brew "postgresql@17"
# brew "poetry"
# brew "pre-commit"
brew "python"
# brew "python@3.10"
# brew "python@3.11"
# brew "python@3.12"
# brew "python@3.13"
brew "ruff"
brew "uv"
# cask "cursor"
cask "dbeaver-community"
cask "docker"
cask "fork"
# cask "github"
# cask "gitup"
cask "jetbrains-toolbox"
cask "pgadmin4"
cask "postman"
# cask "podman-desktop"
cask "mongodb-compass"
cask "pycharm"
# cask "sublime-merge"
# cask "sublime-text"
cask "visual-studio-code"
# cask "visual-studio-code-insiders"
cask "zed"
# cask "zed@preview"


### CLI ###

brew "asciinema"
brew "bash"
brew "bat"
brew "btop"
brew "certifi"
brew "clifm"
brew "cloc"
brew "curl"
brew "docker-completion"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "gping"
brew "htop"
brew "k9s"
brew "kubectl"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "mas"
brew "minikube"
brew "mitmproxy"
brew "ollama"
brew "protobuf"
brew "pure"
brew "pygments"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "telnet"
brew "thefuck"
brew "tree"
brew "wget"
brew "wkhtmltopdf"
brew "yazi"
brew "z"
brew "zoxide"


### Terminal ###

brew "fish"
brew "fisher"
brew "tmux"
# brew "zellij"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "ghostty"
# cask "iterm2"
# cask "kitty"
# cask "warp"


### Tools ###

cask "1password"
cask "aldente"
cask "appcleaner"
cask "balenaetcher"
cask "betterdisplay"
cask "bettertouchtool"
# cask "bitwarden"
# cask "blackhole-2ch"
# cask "cakebrew"
cask "coconutbattery"
# cask "deepl"
# cask "displaperture"
cask "grandperspective"
cask "handy"
# cask "hiddenbar"
cask "imageoptim"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keka"
# cask "little-snitch"
cask "mos"
# cask "ngrok"
cask "protonvpn"
cask "qmk-toolbox"
cask "raycast"
cask "rectangle-pro"
# cask "resilio-sync"
cask "shortcat"
cask "shottr"
# cask "syncthing"
cask "synology-drive"
cask "synologyassistant"
# cask "termius"
cask "topnotch"
# cask "zerotier-one"
cask "tunnelblick"


### Apps ###

cask "adobe-acrobat-reader"
# cask "anydesk"
# cask "arc"
# cask "blender"
cask "calibre"
cask "chatgpt"
# cask "chatgpt-atlas"
cask "claude"
# cask "cloudcompare"
# cask "cron"
cask "cursor"
cask "discord"
cask "epic-games"
# cask "figma"
# cask "firefox"
cask "firefox@nightly"
cask "google-chrome"
cask "iina"
cask "logitech-options"
cask "lulu"
cask "marta"
# cask "meshlab"
# cask "microsoft-teams"
cask "miro"
cask "msty"
cask "notion"
# cask "notion-calendar"
cask "nrlquaker-winbox"
cask "nvidia-geforce-now"
cask "obsidian"
# cask "slack"
cask "spotify"
cask "steam"
# cask "teamviewer"
cask "telegram"
# cask "tigervnc-viewer"
# cask "todoist"
cask "transmission"
cask "vlc"
cask "whatsapp"
cask "zoom"
# cask "vivaldi"
# cask "zen-browser"


### Fonts ###

cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-google-sans-code"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-martian-mono"
cask "font-martian-mono-nerd-font"
cask "font-meslo-lg"
cask "font-meslo-lg-nerd-font"
cask "font-monaspace"
cask "font-poppins"
cask "font-red-hat-mono"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "font-ubuntu-mono"
cask "font-ubuntu-mono-nerd-font"


### App Store ###

mas "Amphetamine", id: 937984704
# mas "Desk Remote Control", id: 1509037746
# mas "FoXray", id: 6448898396
# mas "GarageBand", id: 682658836
# mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "PDFgear", id: 6469021132
# mas "The Unarchiver", id: 425424353
mas "WireGuard", id: 1451685025


### Safari Extensions ###

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
# mas "Bitwarden", id: 1352778147
mas "Consent-O-Matic", id: 1606897889
# mas "DuckDuckGo Privacy for Safari", id: 1482920575
# mas "Hush", id: 1544743900
# mas "Noir", id: 1592917505
# mas "PayPal Honey", id: 1472777122
# mas "Polyglot", id: 1471801525
# mas "Save to Pocket", id: 1477385213
# mas "Save to Raindrop.io", id: 1549370672
mas "SponsorBlock", id: 1573461917
# mas "Vimari", id: 1480933944
# mas "Wipr", id: 1320666476
