akamud.vscode-theme-onedark
akarlsten.vscode-snazzy-akarlsten
alefragnani.project-manager
anysphere.pyright
arcticicestudio.nord-visual-studio-code
batisteo.vscode-django
casualjim.gotemplate
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dracula-theme.theme-dracula
eamodio.gitlens
ecmel.vscode-html-css
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
github.codespaces
github.github-vscode-theme
github.vscode-github-actions
github.vscode-pull-request-github
golang.go
jakebecker.elixir-ls
kevinrose.vsc-python-indent
kisstkondoros.vscode-gutter-preview
mechatroner.rainbow-csv
mikestead.dotenv
modular-mojotools.vscode-mojo
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
mvllow.rose-pine
oderwat.indent-rainbow
peterj.proto
pmndrs.pmndrs
redhat.vscode-xml
redhat.vscode-yaml
rust-lang.rust-analyzer
sdras.night-owl
serayuzgur.crates
sonarsource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tomoki1207.pdf
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscodevim.vim
wayou.vscode-todo-highlight
whizkydee.material-palenight-theme
wholroyd.jinja
zhuangtongfa.material-theme
