akarlsten.vscode-snazzy-akarlsten
alefragnani.project-manager
AndenetAlexander.vim-cheatsheet
batisteo.vscode-django
casualjim.gotemplate
Catppuccin.catppuccin-vsc
Catppuccin.catppuccin-vsc-icons
charliermarsh.ruff
DavidAnson.vscode-markdownlint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dracula-theme.theme-dracula
esbenp.prettier-vscode
GitHub.codespaces
GitHub.copilot
GitHub.copilot-chat
github.vscode-github-actions
golang.go
JakeBecker.elixir-ls
johnpapa.vscode-peacock
KevinRose.vsc-python-indent
mechatroner.rainbow-csv
mikestead.dotenv
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ninoseki.vscode-pylens
oderwat.indent-rainbow
peterj.proto
redhat.vscode-yaml
SonarSource.sonarlint-vscode
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
tatsy.vscode-3d-preview
tomoki1207.pdf
usernamehw.errorlens
VisualStudioExptTeam.intellicode-api-usage-examples
VisualStudioExptTeam.vscodeintellicode
vscodevim.vim
wholroyd.jinja
